3B/ECE358/src/02-Link-Layer-and-LANs.org
#+title: Link Layer And LANs
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="src/latex.css" />

* Introduction
*Link layer* is responsible to transfer a datagram from one node to a physically adjacent node over
a link.

Two types of links: point-to-point and point-to-multipoint (shared medium)

Each link protocol provides different services:
- _framing, link access_ (compulsory)
  - encapsulate datagram into frame, adding header, trailer
  - channel access if shared medium
  - MAC addresses in frame header identify source and destination
- _error detection_
  - errors caused by signal attentuation and noise
  - receiver detects errors, signals retransmission or drops frame
- _error correction_
  - receiver identifies and corrects bit errors without retransmission
- _reliable delivery between adjacent nodes_
  - seldom used on low bit-error links
  - always used on high-error rate wireless links
- _flow control_
  - pacing between sending and receiving nodes

Link layer is implemented in every host, switch, and router, in a *network interface card* (NIC) or
on a chip that attaches into host system buses.
Only one NIC per link.

Communication interfaces:
- sending side
  - encapsulates datagram in frame
  - adds error checking bits, reliable data transfer, flow control, and more
- receiving side
  - looks for errors, reliable data transfer, flow control, and more
  - extracts datagram from frame, passes to upper layer at receiving side

* Framing, Error Detection, Correction
Frame contains datagram with header, footer, and flags.
Header and footer carry link layer protocol info.
Flags help to extract a frame from a bit stream.

*Bit stuffing* can be used:
- use special bit patterns for the flag and idle
- have one flag at the start of data and one at the end of data
- if the flag or idle pattern seem to show up in data, insert extra bits and remove at receiver

Noise and interference cause errors, which often come in bursts.

*Bit Error Rate* (BER) represents how often errors occur on average.

** Error Detection
Performed at link, transport, and network layers.

Uses error detection bits (redundancy), preferably a large field of error detection for better detection.
The protocol may miss some errors, though this is rare.

Can use _parity checking_ (single bit for detection or 2D bit for detection and correction)
since errors come in bursts.

*Cyclic Redundancy Check* (CRC) is more powerful and uses a bit pattern $G$ called the generator
with $r+1$ bits (along with the data $D$):
- the sender computes $r$ CRC bits $R$ such that $\left< D, R \right> = D \times 2^{r} \text{XOR} R$
  is exactly divisible by $G \pmod{2}$
  - $R$ is the remainder of the division (mod 2) of $D \times 2^{r}$ by $G$
- the receiver knows $G$ and divides $\left< D, R \right>$ by $G$
  - if this has a non-zero remainder, errors are detected

CRC can detect all burst errors less than $r + 1$ bits (and any two errors), so it is widely used
in practice.

Correction technique is to correct error at the receiver, but this is computationally expensive and has
high overhead.
This may be useful for real-time communication, long pipes, or noisy channels.

