3B/ECE358/02-Link-Layer-and-LANs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-23 Wed 18:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Link Layer And LANs</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Link Layer And LANs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6fc4f4d">1. Introduction</a></li>
<li><a href="#org8bbaa71">2. Framing, Error Detection, Correction</a>
<ul>
<li><a href="#org1912079">2.1. Error Detection</a></li>
</ul>
</li>
<li><a href="#org4fb88e3">3. Retransmission Mechanisms</a>
<ul>
<li><a href="#org8ee201b">3.1. Stop and Wait</a>
<ul>
<li><a href="#org18643d3">3.1.1. Performance</a></li>
</ul>
</li>
<li><a href="#orgdad851b">3.2. Pipelining</a>
<ul>
<li><a href="#orge9b80ed">3.2.1. Go-Back-N</a></li>
<li><a href="#orgcd5dc11">3.2.2. Selective Repeat</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org64930fc">4. Multiple Access Protocols</a>
<ul>
<li><a href="#org078ae61">4.1. Scheduling Using Time Division Multiple Access</a></li>
<li><a href="#org83470cc">4.2. Scheduling Using Frequency Division Multiple Access</a></li>
<li><a href="#org6c39d6b">4.3. OFDMA</a></li>
<li><a href="#org04cef58">4.4. Polling</a></li>
<li><a href="#orgcd5d723">4.5. Slotted ALOHA</a></li>
<li><a href="#orgeed3519">4.6. Pure ALOHA</a></li>
<li><a href="#org62d4f06">4.7. Carrier Sense Multiple Access (CSMA)</a>
<ul>
<li><a href="#org81481ab">4.7.1. CSMA/CD</a></li>
</ul>
</li>
<li><a href="#orgab8de2e">4.8. Cable Access Network</a></li>
</ul>
</li>
<li><a href="#orgb97ba28">5. LANs</a>
<ul>
<li><a href="#orgbb587f0">5.1. Addressing, ARP</a>
<ul>
<li><a href="#orgdf1e056">5.1.1. MAC Address</a></li>
<li><a href="#org5b2b8d4">5.1.2. Address Resolution Protocol (ARP)</a></li>
<li><a href="#orgfba7ea7">5.1.3. Routing to Another Subnet</a></li>
</ul>
</li>
<li><a href="#orgc6e85bd">5.2. Ethernet</a></li>
<li><a href="#org6783a14">5.3. Switches</a>
<ul>
<li><a href="#org9cd7aef">5.3.1. Switches vs Routers</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6fc4f4d" class="outline-2">
<h2 id="org6fc4f4d"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Link layer</b> is responsible to transfer a datagram from one node to a physically adjacent node over
a link.
</p>

<p>
Two types of links: point-to-point and point-to-multipoint (shared medium)
</p>

<p>
Each link protocol provides different services:
</p>
<ul class="org-ul">
<li><span class="underline">framing, link access</span> (compulsory)
<ul class="org-ul">
<li>encapsulate datagram into frame, adding header, trailer</li>
<li>channel access if shared medium</li>
<li>MAC addresses in frame header identify source and destination</li>
</ul></li>
<li><span class="underline">error detection</span>
<ul class="org-ul">
<li>errors caused by signal attentuation and noise</li>
<li>receiver detects errors, signals retransmission or drops frame</li>
</ul></li>
<li><span class="underline">error correction</span>
<ul class="org-ul">
<li>receiver identifies and corrects bit errors without retransmission</li>
</ul></li>
<li><span class="underline">reliable delivery between adjacent nodes</span>
<ul class="org-ul">
<li>seldom used on low bit-error links</li>
<li>always used on high-error rate wireless links</li>
</ul></li>
<li><span class="underline">flow control</span>
<ul class="org-ul">
<li>pacing between sending and receiving nodes</li>
</ul></li>
</ul>

<p>
Link layer is implemented in every host, switch, and router, in a <b>network interface card</b> (NIC) or
on a chip that attaches into host system buses.
Only one NIC per link.
</p>

<p>
Communication interfaces:
</p>
<ul class="org-ul">
<li>sending side
<ul class="org-ul">
<li>encapsulates datagram in frame</li>
<li>adds error checking bits, reliable data transfer, flow control, and more</li>
</ul></li>
<li>receiving side
<ul class="org-ul">
<li>looks for errors, reliable data transfer, flow control, and more</li>
<li>extracts datagram from frame, passes to upper layer at receiving side</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8bbaa71" class="outline-2">
<h2 id="org8bbaa71"><span class="section-number-2">2.</span> Framing, Error Detection, Correction</h2>
<div class="outline-text-2" id="text-2">
<p>
Frame contains datagram with header, footer, and flags.
Header and footer carry link layer protocol info.
Flags help to extract a frame from a bit stream.
</p>

<p>
<b>Bit stuffing</b> can be used:
</p>
<ul class="org-ul">
<li>use special bit patterns for the flag and idle</li>
<li>have one flag at the start of data and one at the end of data</li>
<li>if the flag or idle pattern seem to show up in data, insert extra bits and remove at receiver</li>
</ul>

<p>
Noise and interference cause errors, which often come in bursts.
</p>

<p>
<b>Bit Error Rate</b> (BER) represents how often errors occur on average.
</p>
</div>
<div id="outline-container-org1912079" class="outline-3">
<h3 id="org1912079"><span class="section-number-3">2.1.</span> Error Detection</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Performed at link, transport, and network layers.
</p>

<p>
Uses error detection bits (redundancy), preferably a large field of error detection for better detection.
The protocol may miss some errors, though this is rare.
</p>

<p>
Can use <span class="underline">parity checking</span> (single bit for detection or 2D bit for detection and correction)
since errors come in bursts.
</p>

<p>
<b>Cyclic Redundancy Check</b> (CRC) is more powerful and uses a bit pattern \(G\) called the generator
with \(r+1\) bits (along with the data \(D\)):
</p>
<ul class="org-ul">
<li>the sender computes \(r\) CRC bits \(R\) such that \(\left< D, R \right> = D \times 2^{r} \text{XOR} R\)
is exactly divisible by \(G \pmod{2}\)
<ul class="org-ul">
<li>\(R\) is the remainder of the division (mod 2) of \(D \times 2^{r}\) by \(G\)</li>
</ul></li>
<li>the receiver knows \(G\) and divides \(\left< D, R \right>\) by \(G\)
<ul class="org-ul">
<li>if this has a non-zero remainder, errors are detected</li>
</ul></li>
</ul>

<p>
CRC can detect all burst errors less than \(r + 1\) bits (and any two errors), so it is widely used
in practice.
</p>

<p>
Correction technique is to correct error at the receiver, but this is computationally expensive and has
high overhead.
This may be useful for real-time communication, long pipes, or noisy channels.
</p>
</div>
</div>
</div>
