3B/ECE358/02-Link-Layer-and-LANs.tex
% Created 2024-10-23 Wed 18:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Link Layer And LANs}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Link Layer And LANs},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Introduction}
\label{sec:org0e1a269}
\textbf{Link layer} is responsible to transfer a datagram from one node to a physically adjacent node over
a link.

Two types of links: point-to-point and point-to-multipoint (shared medium)

Each link protocol provides different services:
\begin{itemize}
\item \uline{framing, link access} (compulsory)
\begin{itemize}
\item encapsulate datagram into frame, adding header, trailer
\item channel access if shared medium
\item MAC addresses in frame header identify source and destination
\end{itemize}
\item \uline{error detection}
\begin{itemize}
\item errors caused by signal attentuation and noise
\item receiver detects errors, signals retransmission or drops frame
\end{itemize}
\item \uline{error correction}
\begin{itemize}
\item receiver identifies and corrects bit errors without retransmission
\end{itemize}
\item \uline{reliable delivery between adjacent nodes}
\begin{itemize}
\item seldom used on low bit-error links
\item always used on high-error rate wireless links
\end{itemize}
\item \uline{flow control}
\begin{itemize}
\item pacing between sending and receiving nodes
\end{itemize}
\end{itemize}

Link layer is implemented in every host, switch, and router, in a \textbf{network interface card} (NIC) or
on a chip that attaches into host system buses.
Only one NIC per link.

Communication interfaces:
\begin{itemize}
\item sending side
\begin{itemize}
\item encapsulates datagram in frame
\item adds error checking bits, reliable data transfer, flow control, and more
\end{itemize}
\item receiving side
\begin{itemize}
\item looks for errors, reliable data transfer, flow control, and more
\item extracts datagram from frame, passes to upper layer at receiving side
\end{itemize}
\end{itemize}
\section{Framing, Error Detection, Correction}
\label{sec:orgb8a48e2}
Frame contains datagram with header, footer, and flags.
Header and footer carry link layer protocol info.
Flags help to extract a frame from a bit stream.

\textbf{Bit stuffing} can be used:
\begin{itemize}
\item use special bit patterns for the flag and idle
\item have one flag at the start of data and one at the end of data
\item if the flag or idle pattern seem to show up in data, insert extra bits and remove at receiver
\end{itemize}

Noise and interference cause errors, which often come in bursts.

\textbf{Bit Error Rate} (BER) represents how often errors occur on average.
\subsection{Error Detection}
\label{sec:org0ee07dd}
Performed at link, transport, and network layers.

Uses error detection bits (redundancy), preferably a large field of error detection for better detection.
The protocol may miss some errors, though this is rare.

Can use \uline{parity checking} (single bit for detection or 2D bit for detection and correction)
since errors come in bursts.

\textbf{Cyclic Redundancy Check} (CRC) is more powerful and uses a bit pattern \(G\) called the generator
with \(r+1\) bits (along with the data \(D\)):
\begin{itemize}
\item the sender computes \(r\) CRC bits \(R\) such that \(\left< D, R \right> = D \times 2^{r} \text{XOR} R\)
is exactly divisible by \(G \pmod{2}\)
\begin{itemize}
\item \(R\) is the remainder of the division (mod 2) of \(D \times 2^{r}\) by \(G\)
\end{itemize}
\item the receiver knows \(G\) and divides \(\left< D, R \right>\) by \(G\)
\begin{itemize}
\item if this has a non-zero remainder, errors are detected
\end{itemize}
\end{itemize}

CRC can detect all burst errors less than \(r + 1\) bits (and any two errors), so it is widely used
in practice.

Correction technique is to correct error at the receiver, but this is computationally expensive and has
high overhead.
This may be useful for real-time communication, long pipes, or noisy channels.
