3B/ECE358/src/02-Link-Layer-and-LANs.org
* Retransmission Mechanisms
Reliable service is an abstraction where, to the network layer, the link layer is a reliable channel.
Specifically, a link is a reliable channel.

The complexity of reliable data transfer depends on the characteristics of an unreliable channel, whether
it loses, corrupts, or reorders data.

A retransmission mechanism should deliver data to the receiver without error, in the right order without
any duplicate.

The sender and receiver do not know the other's state, unless this is communicated via a message on the
same unreliable channel.

The unreliable channel may flip bits in the frame or lose frames, though frames have a CRC.

Only unidirectional data transfer will be considered, though control info will flow in both directions.

** Stop and Wait
Sender sends one packet (frame) and waits for receiver response.

This needs:
- *acknowledgements (ACKs)*: receiver tells sender packet received
- *negative acknowledgements (NAKs)*: receiver tells sender that packet had errors (sender retransmits
  the packet on receipt of NAK)
- *sequence number (SN)*: sender tells receiver which packet this is in the sequence of packets to be sent
  and receiver tells sender which packet this ACK is for
- *timeout*: how long to wait before retransmission

A frame containing a packet or an ACK can be corrupted, lost, or delayed.

With this, the ACK is piggybacking, with separate SN fields for data and ACk in the header.

*** Performance
$U_{sender}$ is *utilization*: the fraction of time the sender is busy sending

$G$ is *goodput*: the number of successful data received per second (packets per second or bits per second)

If no error, the utilization is
$$ \frac{L/R}{A/R + L/R + (2 \times \text{prop})} $$
where $R$ is the link rate, $L$ is the packet length, $A$ is the ACK length, and $\text{prop}$ is the
propagation delay.

For stop and wait, the transmitter is mostly idle and goodput is low.

To tune the timeout perfectly, the timeout must be
$$ \gamma = (2 \times \text{prop}) + \frac{A}{R} $$

A frame is received and acknowledged correctly after
$$ t = \frac{L}{R} + \gamma $$
if the frame and its ACK are not corrupted. Otherwise, it takes $kt$ time where $k-1$ is the number
of retransmissions.

Stop and wait limits the performance of underlying infrastructure (channel).

** Pipelining
Sender allows multiple yet-to-be-acknowledged packets

Retransmission strategies for pipelining are:
- *go-back-N*: receiver only accepts the next expected packet, no extra buffering at the receiver
- *selective repeat*: receiver accepts and stores out of order packets, extra buffering

There is a tradeoff here between network traffic and buffer space and complexity.
These both require a larger range of sequence numbers.

Pipelined retransmission mechanisms are complex but have high performance.

*** Go-Back-N
Sender can have up to $N$ unacknowledged packets in the pipeline.
The _receiver_ only sends cumulative ACKs and does not keep packets out of order.
The _sender_ has a timer for the oldest unacknowledged packets, and if the timer expires,
retransmit all unacknowledged packets.

*Cumulative ACK*: ACKs all packets up to and including the sequence number, and once received
move window forward to begin at the next number

The timer is for the oldest in-flight packet, and so the timeout retransmits that packet and all
higher sequence number packets in the window.

*ACK-only*: always send ACK for the correctly-received packet so far, with the highest in-order
sequence number (no jumps or skips).
This can generate duplicate ACKs.

If an out-of-order packet is received it is discarded and the highest in-order sequence number is
re-ACKed.

Given a sender window size of $N = 2^{n}$, $m>N$ distinct sequence numbers are needed,
which is at least $n+1$ bits.

