3B/ECE358/02-Link-Layer-and-LANs.html
<div id="outline-container-org4fb88e3" class="outline-2">
<h2 id="org4fb88e3"><span class="section-number-2">3.</span> Retransmission Mechanisms</h2>
<div class="outline-text-2" id="text-3">
<p>
Reliable service is an abstraction where, to the network layer, the link layer is a reliable channel.
Specifically, a link is a reliable channel.
</p>

<p>
The complexity of reliable data transfer depends on the characteristics of an unreliable channel, whether
it loses, corrupts, or reorders data.
</p>

<p>
A retransmission mechanism should deliver data to the receiver without error, in the right order without
any duplicate.
</p>

<p>
The sender and receiver do not know the other&rsquo;s state, unless this is communicated via a message on the
same unreliable channel.
</p>

<p>
The unreliable channel may flip bits in the frame or lose frames, though frames have a CRC.
</p>

<p>
Only unidirectional data transfer will be considered, though control info will flow in both directions.
</p>
</div>
<div id="outline-container-org8ee201b" class="outline-3">
<h3 id="org8ee201b"><span class="section-number-3">3.1.</span> Stop and Wait</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Sender sends one packet (frame) and waits for receiver response.
</p>

<p>
This needs:
</p>
<ul class="org-ul">
<li><b>acknowledgements (ACKs)</b>: receiver tells sender packet received</li>
<li><b>negative acknowledgements (NAKs)</b>: receiver tells sender that packet had errors (sender retransmits
the packet on receipt of NAK)</li>
<li><b>sequence number (SN)</b>: sender tells receiver which packet this is in the sequence of packets to be sent
and receiver tells sender which packet this ACK is for</li>
<li><b>timeout</b>: how long to wait before retransmission</li>
</ul>

<p>
A frame containing a packet or an ACK can be corrupted, lost, or delayed.
</p>

<p>
With this, the ACK is piggybacking, with separate SN fields for data and ACk in the header.
</p>
</div>
<div id="outline-container-org18643d3" class="outline-4">
<h4 id="org18643d3"><span class="section-number-4">3.1.1.</span> Performance</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
\(U_{sender}\) is <b>utilization</b>: the fraction of time the sender is busy sending
</p>

<p>
\(G\) is <b>goodput</b>: the number of successful data received per second (packets per second or bits per second)
</p>

<p>
If no error, the utilization is
\[ \frac{L/R}{A/R + L/R + (2 \times \text{prop})} \]
where \(R\) is the link rate, \(L\) is the packet length, \(A\) is the ACK length, and \(\text{prop}\) is the
propagation delay.
</p>

<p>
For stop and wait, the transmitter is mostly idle and goodput is low.
</p>

<p>
To tune the timeout perfectly, the timeout must be
\[ \gamma = (2 \times \text{prop}) + \frac{A}{R} \]
</p>

<p>
A frame is received and acknowledged correctly after
\[ t = \frac{L}{R} + \gamma \]
if the frame and its ACK are not corrupted. Otherwise, it takes \(kt\) time where \(k-1\) is the number
of retransmissions.
</p>

<p>
Stop and wait limits the performance of underlying infrastructure (channel).
</p>
</div>
</div>
</div>
<div id="outline-container-orgdad851b" class="outline-3">
<h3 id="orgdad851b"><span class="section-number-3">3.2.</span> Pipelining</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Sender allows multiple yet-to-be-acknowledged packets
</p>

<p>
Retransmission strategies for pipelining are:
</p>
<ul class="org-ul">
<li><b>go-back-N</b>: receiver only accepts the next expected packet, no extra buffering at the receiver</li>
<li><b>selective repeat</b>: receiver accepts and stores out of order packets, extra buffering</li>
</ul>

<p>
There is a tradeoff here between network traffic and buffer space and complexity.
These both require a larger range of sequence numbers.
</p>

<p>
Pipelined retransmission mechanisms are complex but have high performance.
</p>
</div>
<div id="outline-container-orge9b80ed" class="outline-4">
<h4 id="orge9b80ed"><span class="section-number-4">3.2.1.</span> Go-Back-N</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Sender can have up to \(N\) unacknowledged packets in the pipeline.
The <span class="underline">receiver</span> only sends cumulative ACKs and does not keep packets out of order.
The <span class="underline">sender</span> has a timer for the oldest unacknowledged packets, and if the timer expires,
retransmit all unacknowledged packets.
</p>

<p>
<b>Cumulative ACK</b>: ACKs all packets up to and including the sequence number, and once received
move window forward to begin at the next number
</p>

<p>
The timer is for the oldest in-flight packet, and so the timeout retransmits that packet and all
higher sequence number packets in the window.
</p>

<p>
<b>ACK-only</b>: always send ACK for the correctly-received packet so far, with the highest in-order
sequence number (no jumps or skips).
This can generate duplicate ACKs.
</p>

<p>
If an out-of-order packet is received it is discarded and the highest in-order sequence number is
re-ACKed.
</p>

<p>
Given a sender window size of \(N = 2^{n}\), \(m>N\) distinct sequence numbers are needed,
which is at least \(n+1\) bits.
</p>
</div>
</div>
