3B/ECE358/src/02-Link-Layer-and-LANs.org
*** Selective Repeat
Sender can have up to $N$ unacknowledged packets in the pipeline.
The _receiver_ keeps packets out of order and acknowledges individual frames.
The _sender_ maintains a timer for each unacknowledged packet, and if the timer expires only
retransmit the single unacknowledged packet.

The sender window is $N$ consecutive sequence numbers, and this limits the sequence numbers of
sent, unACKed packets.

The sender checks if the next available SN is in the window and sends the packet accordingly.
If a timeout occurs, only that packet is resent.
Upon receiving an ACK, the packet is marked as received and if it is the smallest unACKed packet,
the window is advanced one step forward.

The receiver sends an ACK for the SN when it receives a packet.
If this is out of order, the packet remains in the buffer.
If this is in order, the packet is then delivered (as well as any buffered in-order packets),
and the window is advanced to the next not-yet-received packet.
If the packet has already been received and is in the window, just return an ACK for that SN.
Otherwise, ignore the packet.

Given a sender window size of $N = 2^{n}$, $m > 2N-1$ distinct SNs are needed.

* Multiple Access Protocols
Two types of links:
- *point-to-point*: between Ethernet switch and host or fiber between routers
- *broadcast (shared wire or medium)*
  - old-fashioned Ethernet
  - cable-based access networks
  - wireless LAN, cellular, satellite

*Multiple Access Mechanism*:
- distributed algorithm that determines how nodes share a channel
- communication about channel sharing must use the same channel as well

Multiple access mechanisms use a single shared broadcast channel, which can cause *collisions* if a
node received 2+ signals at the same time.

The ideal (nonexistent) multiple access mechanism:
- _given_: a multipoint link of rate $R$ bps
- _desiderata_:
  - when a single node wants to transmit, it can send at rate $R$
  - when $M$ nodes want to transmit, each can send at average rate $R/M$
  - fully decentralized
    - no special node to coordinate transmissions
    - no synchronization of clocks, slots
  - simple

Two broad classes of MAC mechanisms:
- scheduling via a control node (*centralized*)
- *random access*: allow collisions and recover
  - when a node has a packet to send, it transmits at full channel data rate $R$, so no coordination
  - protocols specify:
    - degree of politeness
    - how to detect collisions
    - how to recover from collisions

** Scheduling Using Time Division Multiple Access
Time is divided into time slots and there is a repeating cycle.
The controller allocates time slots to stations.
When a station's frame occurs, it can broadcast.

** Scheduling Using Frequency Division Multiple Access
Channel spectrum is divided into frequency bands.
Each station can broadcast in their allocated frequency band.

** OFDMA
*Orthogonal Frequency-Division Multiple Access*: mix of TDMA and FDMA, each station has some frequency
band(s) and time band(s).

** Polling
Used before scheduling, but still used in Bluetooth.

Master invites nodes to transmit in turn.

Has polling overhead, latency, and single point of failure (master).

** Slotted ALOHA
Assume the following:
- all L2 frames are the same size
- time is divided into equally sized slots, where each is the time to transmit a single L2 frame
- nodes start to transmit at slot beginning and are synchronized
- if 2+ nodes transmit in a slot, all nodes detect collision before the next slot

When a node obtains a new frame, it transmit it until success:
- /if no collision/: the node can move onto the next frame (if it exists)
- /if collision/: node retransmits the frame in each subsequent slot with probability $p$ until success

Advantages:
- single active node continuously transmit at the full rate of the channel
- highly decentralized: only slots need to be synchronized
- simple

Disadvantages:
- collisions waste slots
- idle slots are likely
- nodes may be able to detect collision less than time to transmit packet
- must have clock synchronization

*Efficiency*: long-run fraction of successful slots

Max efficiency is $1/e = 0.37$, so at best, the channel is used for useful transmissions 37% of the time.

