3B/ECE358/02-Link-Layer-and-LANs.html
<div id="outline-container-orgcd5dc11" class="outline-4">
<h4 id="orgcd5dc11"><span class="section-number-4">3.2.2.</span> Selective Repeat</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Sender can have up to \(N\) unacknowledged packets in the pipeline.
The <span class="underline">receiver</span> keeps packets out of order and acknowledges individual frames.
The <span class="underline">sender</span> maintains a timer for each unacknowledged packet, and if the timer expires only
retransmit the single unacknowledged packet.
</p>

<p>
The sender window is \(N\) consecutive sequence numbers, and this limits the sequence numbers of
sent, unACKed packets.
</p>

<p>
The sender checks if the next available SN is in the window and sends the packet accordingly.
If a timeout occurs, only that packet is resent.
Upon receiving an ACK, the packet is marked as received and if it is the smallest unACKed packet,
the window is advanced one step forward.
</p>

<p>
The receiver sends an ACK for the SN when it receives a packet.
If this is out of order, the packet remains in the buffer.
If this is in order, the packet is then delivered (as well as any buffered in-order packets),
and the window is advanced to the next not-yet-received packet.
If the packet has already been received and is in the window, just return an ACK for that SN.
Otherwise, ignore the packet.
</p>

<p>
Given a sender window size of \(N = 2^{n}\), \(m > 2N-1\) distinct SNs are needed.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org64930fc" class="outline-2">
<h2 id="org64930fc"><span class="section-number-2">4.</span> Multiple Access Protocols</h2>
<div class="outline-text-2" id="text-4">
<p>
Two types of links:
</p>
<ul class="org-ul">
<li><b>point-to-point</b>: between Ethernet switch and host or fiber between routers</li>
<li><b>broadcast (shared wire or medium)</b>
<ul class="org-ul">
<li>old-fashioned Ethernet</li>
<li>cable-based access networks</li>
<li>wireless LAN, cellular, satellite</li>
</ul></li>
</ul>

<p>
<b>Multiple Access Mechanism</b>:
</p>
<ul class="org-ul">
<li>distributed algorithm that determines how nodes share a channel</li>
<li>communication about channel sharing must use the same channel as well</li>
</ul>

<p>
Multiple access mechanisms use a single shared broadcast channel, which can cause <b>collisions</b> if a
node received 2+ signals at the same time.
</p>

<p>
The ideal (nonexistent) multiple access mechanism:
</p>
<ul class="org-ul">
<li><span class="underline">given</span>: a multipoint link of rate \(R\) bps</li>
<li><span class="underline">desiderata</span>:
<ul class="org-ul">
<li>when a single node wants to transmit, it can send at rate \(R\)</li>
<li>when \(M\) nodes want to transmit, each can send at average rate \(R/M\)</li>
<li>fully decentralized
<ul class="org-ul">
<li>no special node to coordinate transmissions</li>
<li>no synchronization of clocks, slots</li>
</ul></li>
<li>simple</li>
</ul></li>
</ul>

<p>
Two broad classes of MAC mechanisms:
</p>
<ul class="org-ul">
<li>scheduling via a control node (<b>centralized</b>)</li>
<li><b>random access</b>: allow collisions and recover
<ul class="org-ul">
<li>when a node has a packet to send, it transmits at full channel data rate \(R\), so no coordination</li>
<li>protocols specify:
<ul class="org-ul">
<li>degree of politeness</li>
<li>how to detect collisions</li>
<li>how to recover from collisions</li>
</ul></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org078ae61" class="outline-3">
<h3 id="org078ae61"><span class="section-number-3">4.1.</span> Scheduling Using Time Division Multiple Access</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Time is divided into time slots and there is a repeating cycle.
The controller allocates time slots to stations.
When a station&rsquo;s frame occurs, it can broadcast.
</p>
</div>
</div>
<div id="outline-container-org83470cc" class="outline-3">
<h3 id="org83470cc"><span class="section-number-3">4.2.</span> Scheduling Using Frequency Division Multiple Access</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Channel spectrum is divided into frequency bands.
Each station can broadcast in their allocated frequency band.
</p>
</div>
</div>
<div id="outline-container-org6c39d6b" class="outline-3">
<h3 id="org6c39d6b"><span class="section-number-3">4.3.</span> OFDMA</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>Orthogonal Frequency-Division Multiple Access</b>: mix of TDMA and FDMA, each station has some frequency
band(s) and time band(s).
</p>
</div>
</div>
<div id="outline-container-org04cef58" class="outline-3">
<h3 id="org04cef58"><span class="section-number-3">4.4.</span> Polling</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Used before scheduling, but still used in Bluetooth.
</p>

<p>
Master invites nodes to transmit in turn.
</p>

<p>
Has polling overhead, latency, and single point of failure (master).
</p>
</div>
</div>
<div id="outline-container-orgcd5d723" class="outline-3">
<h3 id="orgcd5d723"><span class="section-number-3">4.5.</span> Slotted ALOHA</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Assume the following:
</p>
<ul class="org-ul">
<li>all L2 frames are the same size</li>
<li>time is divided into equally sized slots, where each is the time to transmit a single L2 frame</li>
<li>nodes start to transmit at slot beginning and are synchronized</li>
<li>if 2+ nodes transmit in a slot, all nodes detect collision before the next slot</li>
</ul>

<p>
When a node obtains a new frame, it transmit it until success:
</p>
<ul class="org-ul">
<li><i>if no collision</i>: the node can move onto the next frame (if it exists)</li>
<li><i>if collision</i>: node retransmits the frame in each subsequent slot with probability \(p\) until success</li>
</ul>

<p>
Advantages:
</p>
<ul class="org-ul">
<li>single active node continuously transmit at the full rate of the channel</li>
<li>highly decentralized: only slots need to be synchronized</li>
<li>simple</li>
</ul>

<p>
Disadvantages:
</p>
<ul class="org-ul">
<li>collisions waste slots</li>
<li>idle slots are likely</li>
<li>nodes may be able to detect collision less than time to transmit packet</li>
<li>must have clock synchronization</li>
</ul>

<p>
<b>Efficiency</b>: long-run fraction of successful slots
</p>

<p>
Max efficiency is \(1/e = 0.37\), so at best, the channel is used for useful transmissions 37% of the time.
</p>
</div>
</div>
