3B/ECE358/02-Link-Layer-and-LANs.tex
\subsubsection{Selective Repeat}
\label{sec:org52f1386}
Sender can have up to \(N\) unacknowledged packets in the pipeline.
The \uline{receiver} keeps packets out of order and acknowledges individual frames.
The \uline{sender} maintains a timer for each unacknowledged packet, and if the timer expires only
retransmit the single unacknowledged packet.

The sender window is \(N\) consecutive sequence numbers, and this limits the sequence numbers of
sent, unACKed packets.

The sender checks if the next available SN is in the window and sends the packet accordingly.
If a timeout occurs, only that packet is resent.
Upon receiving an ACK, the packet is marked as received and if it is the smallest unACKed packet,
the window is advanced one step forward.

The receiver sends an ACK for the SN when it receives a packet.
If this is out of order, the packet remains in the buffer.
If this is in order, the packet is then delivered (as well as any buffered in-order packets),
and the window is advanced to the next not-yet-received packet.
If the packet has already been received and is in the window, just return an ACK for that SN.
Otherwise, ignore the packet.

Given a sender window size of \(N = 2^{n}\), \(m > 2N-1\) distinct SNs are needed.
\section{Multiple Access Protocols}
\label{sec:orgb736fb4}
Two types of links:
\begin{itemize}
\item \textbf{point-to-point}: between Ethernet switch and host or fiber between routers
\item \textbf{broadcast (shared wire or medium)}
\begin{itemize}
\item old-fashioned Ethernet
\item cable-based access networks
\item wireless LAN, cellular, satellite
\end{itemize}
\end{itemize}

\textbf{Multiple Access Mechanism}:
\begin{itemize}
\item distributed algorithm that determines how nodes share a channel
\item communication about channel sharing must use the same channel as well
\end{itemize}

Multiple access mechanisms use a single shared broadcast channel, which can cause \textbf{collisions} if a
node received 2+ signals at the same time.

The ideal (nonexistent) multiple access mechanism:
\begin{itemize}
\item \uline{given}: a multipoint link of rate \(R\) bps
\item \uline{desiderata}:
\begin{itemize}
\item when a single node wants to transmit, it can send at rate \(R\)
\item when \(M\) nodes want to transmit, each can send at average rate \(R/M\)
\item fully decentralized
\begin{itemize}
\item no special node to coordinate transmissions
\item no synchronization of clocks, slots
\end{itemize}
\item simple
\end{itemize}
\end{itemize}

Two broad classes of MAC mechanisms:
\begin{itemize}
\item scheduling via a control node (\textbf{centralized})
\item \textbf{random access}: allow collisions and recover
\begin{itemize}
\item when a node has a packet to send, it transmits at full channel data rate \(R\), so no coordination
\item protocols specify:
\begin{itemize}
\item degree of politeness
\item how to detect collisions
\item how to recover from collisions
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Scheduling Using Time Division Multiple Access}
\label{sec:org8891518}
Time is divided into time slots and there is a repeating cycle.
The controller allocates time slots to stations.
When a station's frame occurs, it can broadcast.
\subsection{Scheduling Using Frequency Division Multiple Access}
\label{sec:org1bfe788}
Channel spectrum is divided into frequency bands.
Each station can broadcast in their allocated frequency band.
\subsection{OFDMA}
\label{sec:orgedd6aa0}
\textbf{Orthogonal Frequency-Division Multiple Access}: mix of TDMA and FDMA, each station has some frequency
band(s) and time band(s).
\subsection{Polling}
\label{sec:orgc5df19e}
Used before scheduling, but still used in Bluetooth.

Master invites nodes to transmit in turn.

Has polling overhead, latency, and single point of failure (master).
\subsection{Slotted ALOHA}
\label{sec:org3d7f5ac}
Assume the following:
\begin{itemize}
\item all L2 frames are the same size
\item time is divided into equally sized slots, where each is the time to transmit a single L2 frame
\item nodes start to transmit at slot beginning and are synchronized
\item if 2+ nodes transmit in a slot, all nodes detect collision before the next slot
\end{itemize}

When a node obtains a new frame, it transmit it until success:
\begin{itemize}
\item \emph{if no collision}: the node can move onto the next frame (if it exists)
\item \emph{if collision}: node retransmits the frame in each subsequent slot with probability \(p\) until success
\end{itemize}

Advantages:
\begin{itemize}
\item single active node continuously transmit at the full rate of the channel
\item highly decentralized: only slots need to be synchronized
\item simple
\end{itemize}

Disadvantages:
\begin{itemize}
\item collisions waste slots
\item idle slots are likely
\item nodes may be able to detect collision less than time to transmit packet
\item must have clock synchronization
\end{itemize}

\textbf{Efficiency}: long-run fraction of successful slots

Max efficiency is \(1/e = 0.37\), so at best, the channel is used for useful transmissions 37\% of the time.
