3B/ECE358/src/02-Link-Layer-and-LANs.org
** Pure ALOHA
No synchronization so no slots.
When the frame arrives, transmit immediately.

Collision probability increases since the frame will collide with any frames sent before or after it
within the time it takes to send a single frame.

Max efficiency is 18%.

** Carrier Sense Multiple Access (CSMA)
Listen before transmit; if the channel is busy, defer transmission until it is free

Collisions can still occur since propagation delay means that two nodes may not hear transmissions
from the other started around the same time.

If a collision occurs, the entire packet transmission time was wasted.
This depends on the distance and propagation delay.

*** CSMA/CD
CSMA with collision detection:
- collisions are detected quickly
- upon collision, abort transmission

Collision detection is easier in wired LANs since signal strengths can be measured so that transmitted
and received signals can be compared.

Let $T_{p}$ be the maximum propagation delay and $T_{C}$ be time after which everyone is
aware of the collision.
The minimum frame size so that the first sender can detect that there is a collision is
$F_{min}/R > T_{C}$, where $R$ is the rate.

After aborting, the NIC enters *binary (exponential) backoff*, so it creates time-slots of 512 bit times.
After the collision $m$ for $m < 16$, the NIC chooses a random number between 0 and $2^{m} - 1$
and waits 512 times this number before retrying.
After collision 16, the NIC aborts sending the frame.

Consider a maximum propagation delay between 2 nodes of $T_{p}$ and transmission time for the max-size
frame $t_{trans}.
The efficiency is
$$ \frac{1}{1 + 5T_{p}/t_{trans}} $$

As $T_{p}$ goes to 0 and as $t_{trans}$ goes to $\infty$, the efficiency goes to 1.

Much better performance than ALOHA, and simple, cheap, and decentralized.

** Cable Access Network
Can use FDM, TDM, and random access.

Uses multiple downstream (broadcast) FDM channels (up to 1.6 Gbps/channel).
A single cable modem termination system transmits into channels.

Uses multiple upstream channels (up to 1 Gbps/channel) that use multiple access:
all users content for certain upstream mini time slots to send requests, others use time slots that
are assigned through a map.

* LANs
LANs are cheap, easy to install, and can be large.

Ancient LANs were a shared link. Modern LANs are many shared links connected by L2 switches.

** Addressing, ARP
*** MAC Address
Each interface on a LAN has a unique 48-bit MAC address.
This is usually burned into NIC ROM, but can also be set with software sometimes.

Allocation is administered by IEEE.
MAC flat address can move from one LAN to another, so it is portable.

The broadcast address is FF-FF-FF-FF-FF-FF.

MAC addresses are used locally to get frames from interface to another physically-connected interface.

*** Address Resolution Protocol (ARP)
Each node on a LAN has an ARP table that has:
- IP/MAC address mappings for some LAN nodes
- *TTL (time to live)* for each node, which is the time after which the address mapping will be
  forgotten

To get a MAC address, a node will broadcast an ARP query containing the related IP address
and another node will reply with the relevant MAC address.

*** Routing to Another Subnet
To send a datagram from $A$ to $B$ via router $R$, assuming:
- $A$ knows the IP address of $B$
- $A$ knows the IP address of $R$
- $A$ knows the MAC address of $R$

$A$ creates an IP datagram with IP source $A$ and destination $B$.
$A$ then creates a link-layer frame containing this datagram, with the MAC address of $R$ as the
frame's destination.

Upon receipt at $R$, $R$ repeats the same process to $B$.

