3B/ECE358/02-Link-Layer-and-LANs.html
<div id="outline-container-orgeed3519" class="outline-3">
<h3 id="orgeed3519"><span class="section-number-3">4.6.</span> Pure ALOHA</h3>
<div class="outline-text-3" id="text-4-6">
<p>
No synchronization so no slots.
When the frame arrives, transmit immediately.
</p>

<p>
Collision probability increases since the frame will collide with any frames sent before or after it
within the time it takes to send a single frame.
</p>

<p>
Max efficiency is 18%.
</p>
</div>
</div>
<div id="outline-container-org62d4f06" class="outline-3">
<h3 id="org62d4f06"><span class="section-number-3">4.7.</span> Carrier Sense Multiple Access (CSMA)</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Listen before transmit; if the channel is busy, defer transmission until it is free
</p>

<p>
Collisions can still occur since propagation delay means that two nodes may not hear transmissions
from the other started around the same time.
</p>

<p>
If a collision occurs, the entire packet transmission time was wasted.
This depends on the distance and propagation delay.
</p>
</div>
<div id="outline-container-org81481ab" class="outline-4">
<h4 id="org81481ab"><span class="section-number-4">4.7.1.</span> CSMA/CD</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
CSMA with collision detection:
</p>
<ul class="org-ul">
<li>collisions are detected quickly</li>
<li>upon collision, abort transmission</li>
</ul>

<p>
Collision detection is easier in wired LANs since signal strengths can be measured so that transmitted
and received signals can be compared.
</p>

<p>
Let \(T_{p}\) be the maximum propagation delay and \(T_{C}\) be time after which everyone is
aware of the collision.
The minimum frame size so that the first sender can detect that there is a collision is
\(F_{min}/R > T_{C}\), where \(R\) is the rate.
</p>

<p>
After aborting, the NIC enters <b>binary (exponential) backoff</b>, so it creates time-slots of 512 bit times.
After the collision \(m\) for \(m < 16\), the NIC chooses a random number between 0 and \(2^{m} - 1\)
and waits 512 times this number before retrying.
After collision 16, the NIC aborts sending the frame.
</p>

<p>
Consider a maximum propagation delay between 2 nodes of \(T_{p}\) and transmission time for the max-size
frame $t<sub>trans</sub>.
The efficiency is
\[ \frac{1}{1 + 5T_{p}/t_{trans}} \]
</p>

<p>
As \(T_{p}\) goes to 0 and as \(t_{trans}\) goes to \(\infty\), the efficiency goes to 1.
</p>

<p>
Much better performance than ALOHA, and simple, cheap, and decentralized.
</p>
</div>
</div>
</div>
<div id="outline-container-orgab8de2e" class="outline-3">
<h3 id="orgab8de2e"><span class="section-number-3">4.8.</span> Cable Access Network</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Can use FDM, TDM, and random access.
</p>

<p>
Uses multiple downstream (broadcast) FDM channels (up to 1.6 Gbps/channel).
A single cable modem termination system transmits into channels.
</p>

<p>
Uses multiple upstream channels (up to 1 Gbps/channel) that use multiple access:
all users content for certain upstream mini time slots to send requests, others use time slots that
are assigned through a map.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb97ba28" class="outline-2">
<h2 id="orgb97ba28"><span class="section-number-2">5.</span> LANs</h2>
<div class="outline-text-2" id="text-5">
<p>
LANs are cheap, easy to install, and can be large.
</p>

<p>
Ancient LANs were a shared link. Modern LANs are many shared links connected by L2 switches.
</p>
</div>
<div id="outline-container-orgbb587f0" class="outline-3">
<h3 id="orgbb587f0"><span class="section-number-3">5.1.</span> Addressing, ARP</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgdf1e056" class="outline-4">
<h4 id="orgdf1e056"><span class="section-number-4">5.1.1.</span> MAC Address</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Each interface on a LAN has a unique 48-bit MAC address.
This is usually burned into NIC ROM, but can also be set with software sometimes.
</p>

<p>
Allocation is administered by IEEE.
MAC flat address can move from one LAN to another, so it is portable.
</p>

<p>
The broadcast address is FF-FF-FF-FF-FF-FF.
</p>

<p>
MAC addresses are used locally to get frames from interface to another physically-connected interface.
</p>
</div>
</div>
<div id="outline-container-org5b2b8d4" class="outline-4">
<h4 id="org5b2b8d4"><span class="section-number-4">5.1.2.</span> Address Resolution Protocol (ARP)</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Each node on a LAN has an ARP table that has:
</p>
<ul class="org-ul">
<li>IP/MAC address mappings for some LAN nodes</li>
<li><b>TTL (time to live)</b> for each node, which is the time after which the address mapping will be
forgotten</li>
</ul>

<p>
To get a MAC address, a node will broadcast an ARP query containing the related IP address
and another node will reply with the relevant MAC address.
</p>
</div>
</div>
<div id="outline-container-orgfba7ea7" class="outline-4">
<h4 id="orgfba7ea7"><span class="section-number-4">5.1.3.</span> Routing to Another Subnet</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
To send a datagram from \(A\) to \(B\) via router \(R\), assuming:
</p>
<ul class="org-ul">
<li>\(A\) knows the IP address of \(B\)</li>
<li>\(A\) knows the IP address of \(R\)</li>
<li>\(A\) knows the MAC address of \(R\)</li>
</ul>

<p>
\(A\) creates an IP datagram with IP source \(A\) and destination \(B\).
\(A\) then creates a link-layer frame containing this datagram, with the MAC address of \(R\) as the
frame&rsquo;s destination.
</p>

<p>
Upon receipt at \(R\), \(R\) repeats the same process to \(B\).
</p>
</div>
</div>
</div>
