3B/ECE358/src/02-Link-Layer-and-LANs.org
** Ethernet
Standards define:
- network topology
- endpoint addressing scheme
- frame (packet) format
- media access mechanism
- physical layer aspects and wiring

Standards issued by IEEE, IETF, ITU, ISO, and W3C.

IEEE Project 802 focuses on L1 and L2, dividing L2 into /logical link control/ (LLC) and
/media access control/ (MAC).

Ethernet is the dominant wired LAN technology. It is simple, cheap, high speed and uses a single
chip to produce multiple speeds.

*Bus*: all nodes in the same collision domain

*Switched*: active link-layer 2 switch in center, with each spoke running a separate Ethernet protocol
(no collision)

The Ethernet frame structure involves encapsulating IP datagram in Ethernet frame with a preamble
(used to synchronize receiver and sender), destination address, source address, type (higher layer
protocol), data, and CRC (4 bytes).

Addresses are destination MAC addresses.

The minimum frame size is 64 bytes and maximum datagram size is 1500 bytes.

*Connectionless*: no handshaking between sending and receiving NICs

*Unreliable*: receiving NIC doesn't send ACKs or NAKs, so data in dropped frames can only be
recovered at higher levels

MAC protocol is unslotted CSMA/CD with binary backoff.

** Switches
Link-layer device that takes an active role by storing and forwarding Ethernet frames.

Switches examine incoming frame's MAC address, and selectively forwards frame to 1+ outgoing links
using CSMA/CD to access each link.

*Transparent*: hosts unaware of presence of switches

*Plug-and-play*: switches do not need to be configured

Hosts have dedicated, direct connection to switch which switches buffer packets.

The Ethernet protocol is used on each incoming link so there are no collisions (full duplex)
and each link is in its own collision domain.

Transmissions can occur simultaneously without collisions as long as there is no overlap
in the interfaces used.

Each switch has a *switch table* where each entry has:
- MAC address of host
- interface to reach host
- timestamp

The switch learns which hosts can be reached through which interfaces.
It learns the location of the sender from the incoming LAN segment and records the
sender/location pair in the switch table.

To learn the location of the destination, it sends a flood.

Self-learning switches can be connected together.

*** Switches vs Routers
Both are store and forward and have forwarding tables.

*Router*: network-layer device (examine network-layer headers)

*Switch*: link-layer device (examine link-layer headers)

Routers compute tables using routing algorithms and IP addresses.
Switches learn forwarding table through flooding, learning, and
MAC addresses.
