3B/ECE358/02-Link-Layer-and-LANs.html
<div id="outline-container-orgc6e85bd" class="outline-3">
<h3 id="orgc6e85bd"><span class="section-number-3">5.2.</span> Ethernet</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Standards define:
</p>
<ul class="org-ul">
<li>network topology</li>
<li>endpoint addressing scheme</li>
<li>frame (packet) format</li>
<li>media access mechanism</li>
<li>physical layer aspects and wiring</li>
</ul>

<p>
Standards issued by IEEE, IETF, ITU, ISO, and W3C.
</p>

<p>
IEEE Project 802 focuses on L1 and L2, dividing L2 into <i>logical link control</i> (LLC) and
<i>media access control</i> (MAC).
</p>

<p>
Ethernet is the dominant wired LAN technology. It is simple, cheap, high speed and uses a single
chip to produce multiple speeds.
</p>

<p>
<b>Bus</b>: all nodes in the same collision domain
</p>

<p>
<b>Switched</b>: active link-layer 2 switch in center, with each spoke running a separate Ethernet protocol
(no collision)
</p>

<p>
The Ethernet frame structure involves encapsulating IP datagram in Ethernet frame with a preamble
(used to synchronize receiver and sender), destination address, source address, type (higher layer
protocol), data, and CRC (4 bytes).
</p>

<p>
Addresses are destination MAC addresses.
</p>

<p>
The minimum frame size is 64 bytes and maximum datagram size is 1500 bytes.
</p>

<p>
<b>Connectionless</b>: no handshaking between sending and receiving NICs
</p>

<p>
<b>Unreliable</b>: receiving NIC doesn&rsquo;t send ACKs or NAKs, so data in dropped frames can only be
recovered at higher levels
</p>

<p>
MAC protocol is unslotted CSMA/CD with binary backoff.
</p>
</div>
</div>
<div id="outline-container-org6783a14" class="outline-3">
<h3 id="org6783a14"><span class="section-number-3">5.3.</span> Switches</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Link-layer device that takes an active role by storing and forwarding Ethernet frames.
</p>

<p>
Switches examine incoming frame&rsquo;s MAC address, and selectively forwards frame to 1+ outgoing links
using CSMA/CD to access each link.
</p>

<p>
<b>Transparent</b>: hosts unaware of presence of switches
</p>

<p>
<b>Plug-and-play</b>: switches do not need to be configured
</p>

<p>
Hosts have dedicated, direct connection to switch which switches buffer packets.
</p>

<p>
The Ethernet protocol is used on each incoming link so there are no collisions (full duplex)
and each link is in its own collision domain.
</p>

<p>
Transmissions can occur simultaneously without collisions as long as there is no overlap
in the interfaces used.
</p>

<p>
Each switch has a <b>switch table</b> where each entry has:
</p>
<ul class="org-ul">
<li>MAC address of host</li>
<li>interface to reach host</li>
<li>timestamp</li>
</ul>

<p>
The switch learns which hosts can be reached through which interfaces.
It learns the location of the sender from the incoming LAN segment and records the
sender/location pair in the switch table.
</p>

<p>
To learn the location of the destination, it sends a flood.
</p>

<p>
Self-learning switches can be connected together.
</p>
</div>
<div id="outline-container-org9cd7aef" class="outline-4">
<h4 id="org9cd7aef"><span class="section-number-4">5.3.1.</span> Switches vs Routers</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Both are store and forward and have forwarding tables.
</p>

<p>
<b>Router</b>: network-layer device (examine network-layer headers)
</p>

<p>
<b>Switch</b>: link-layer device (examine link-layer headers)
</p>

<p>
Routers compute tables using routing algorithms and IP addresses.
Switches learn forwarding table through flooding, learning, and
MAC addresses.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-23 Wed 18:51</p>
</div>
</body>
</html>
